app/Models/CommonModel.php

    public function selectQuery()
    {
        $builder = $this->db->table("sheet1");
        $builder->select("firstname,lastname,address,phonenumber");
        //$builder-> where("key", "1213");
        $result = $builder->get();
---
SELECT `firstname`, `lastname`, `address`, `phonenumber`
FROM `sheet1`